src/config/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/РезервНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РезервНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/ТоварыКПередачеСоСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКПередачеСоСкладов</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Enums/СпособыСписанияОстаткаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособыСписанияОстаткаТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзРезерва</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оптовый</Name>
					<Comment>(Общ) Оптовый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розничный</Name>
					<Comment>(Общ) Розничный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеавтоматизированнаяТорговаяТочка</Name>
					<Comment>(Общ) Неавтоматизированная торговая точка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Documents/ВнутреннийЗаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ВнутреннийЗаказ</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказовПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоРазмещение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоРезервирование</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаказа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВнутреннегоЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминания</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапомнитьОСобытии</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияМест</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратнаяТара</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/ТоварыНаСкладах/Ext/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщегние.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - строка, имя табличной части, которая проводится по регистру, 
//  СтруктураШапкиДокумента - структура, содержащая значения "через точку" ссылочных реквизитов по шапке документа,
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
//  23.03.2017 - "флНеоперативно" - есть Истина - то остатки проверяются на дату документа!
//  флНеоперативно=Истина - ДЛЯ ВСЕХ документов проверяются остатки на ДокументОбъект.Дата
//  в реализациях и перемещениях сделана проверка ВСЕГДА!
//  в остальных документах - только при операвном проведении
//
Процедура КонтрольОстатков(ДокументОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента, Отказ, Заголовок, флНеоперативно=ЛОЖЬ ) Экспорт

	Если РазрешеноПревышениеОстаткаТоваровНаСкладе() Тогда
		Возврат;
	КонецЕсли;

	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;
	ИмяТаблицы          = ИмяДокумента + "." + СокрЛП(ИмяТабличнойЧасти);
	ЕстьСерия           = ЕстьРеквизитТабЧастиДокумента("СерияНоменклатуры", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьХарактеристика  = ЕстьРеквизитТабЧастиДокумента("ХарактеристикаНоменклатуры", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьСпособСписания  = ЕстьРеквизитТабЧастиДокумента("СпособСписанияОстаткаТоваров", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьДокументРезерва = ЕстьРеквизитТабЧастиДокумента("ДокументРезерва", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьСкладВТабЧасти  = ЕстьРеквизитТабЧастиДокумента("Склад", МетаданныеДокумента, ИмяТабличнойЧасти);
	
	// { Лапенков 20120605 - склады проверяются в таб. части во всех документах кроме перемещения 
	// в перемещении : если внутренний заказ заполнен - контроль из таб. части, иначе из шапки
	ЕстьСкладВТабЧасти = ЕстьСкладВТабЧасти  И  ((МетаданныеДокумента.Имя<>"ПеремещениеТоваров") 
	ИЛИ (МетаданныеДокумента.Имя="ПеремещениеТоваров" И ЗначениеЗаполнено(ДокументОбъект.ВнутреннийЗаказ)));
	// }
	ЕстьДокументПередачи= ЕстьРеквизитДокумента("ДокументПередачи", МетаданныеДокумента);
	ЕстьКачество        = ЕстьРеквизитТабЧастиДокумента("Качество", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьКоэффициент     = ЕстьРеквизитТабЧастиДокумента("Коэффициент", МетаданныеДокумента, ИмяТабличнойЧасти);

	ЕстьЗаказПокупателяВШапке = Ложь;
	Если ЕстьРеквизитДокумента("Сделка", МетаданныеДокумента) Тогда
		ИмяРеквизитаЗаказ = "Сделка";
		ЕстьЗаказПокупателяВШапке = НЕ ЗначениеНеЗаполнено(СтруктураШапкиДокумента.Сделка) 
									И ТипЗнч(СтруктураШапкиДокумента.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя");
	ИначеЕсли ЕстьРеквизитДокумента("Заказ", МетаданныеДокумента) Тогда
		ИмяРеквизитаЗаказ = "Заказ";
		ЕстьЗаказПокупателяВШапке = НЕ ЗначениеНеЗаполнено(СтруктураШапкиДокумента.Заказ) 
									И ( ТипЗнч(СтруктураШапкиДокумента.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя")
									ИЛИ ТипЗнч(СтруктураШапкиДокумента.Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ"));
	ИначеЕсли ЕстьРеквизитДокумента("ВнутреннийЗаказ", МетаданныеДокумента) Тогда
		ИмяРеквизитаЗаказ = "ВнутреннийЗаказ";
		ЕстьЗаказПокупателяВШапке = НЕ ЗначениеНеЗаполнено(СтруктураШапкиДокумента.ВнутреннийЗаказ) 
									И ( ТипЗнч(СтруктураШапкиДокумента.ВнутреннийЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя")
									ИЛИ ТипЗнч(СтруктураШапкиДокумента.ВнутреннийЗаказ) = Тип("ДокументСсылка.ВнутреннийЗаказ"));
		Если ЕстьЗаказПокупателяВШапке Тогда
			ЕстьДокументРезерва = Ложь;
		КонецЕсли;
	КонецЕсли;

	// Текст вложенного запроса, ограничивающего номенклатуру при получении остатков
	//14.11.2017
	ТекстЗапросаСписокНоменклатуры = "ВЫБРАТЬ тч.Номенклатура 
									  |ИЗ ВТ_Товары как тч";


	Запрос = Новый Запрос;

	// Для перемещения надо проверять по складу "Склад-отправитель", а для остальных документов - просто "Склад"
	ТекСклад = СтруктураШапкиДокумента.Склад;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("Склад", ТекСклад); 
	Запрос.УстановитьПараметр("СоСклада", Перечисления.СпособыСписанияОстаткаТоваров.СоСклада); 
	Запрос.УстановитьПараметр("ИзРезерва", Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва); 
	Запрос.УстановитьПараметр("ПустойЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка()); 
	Запрос.УстановитьПараметр("ПустойВнутреннийЗаказ", Документы.ВнутреннийЗаказ.ПустаяСсылка()); 
	Запрос.УстановитьПараметр("НТТ", Перечисления.ВидыСкладов.НеавтоматизированнаяТорговаяТочка); 
	Запрос.УстановитьПараметр("ПустойОрдер", Документы.ПриходныйОрдерНаТовары.ПустаяСсылка()); 

	Если ЕстьЗаказПокупателяВШапке Тогда
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", СтруктураШапкиДокумента[ИмяРеквизитаЗаказ]);
		
		//14.12.2016 - для перемещений - указывается "Внутренний заказ", а нужен ЗаказПокупателя
		Если ТипЗнч( СтруктураШапкиДокумента[ИмяРеквизитаЗаказ] ) = Тип("ДокументСсылка.ВнутреннийЗаказ") тогда
			Запрос.УстановитьПараметр("ЗаказПокупателя2", СтруктураШапкиДокумента[ИмяРеквизитаЗаказ].ДокументОснование);
		    Запрос.УстановитьПараметр("ЗаказПокупателя",  СтруктураШапкиДокумента[ИмяРеквизитаЗаказ].ДокументОснование);  //26.04.2017
			
		////исключаем резерв по заказу из самой реализации - //26.04.2017 - 30.10.2018 
		ИначеЕсли ТипЗнч( СтруктураШапкиДокумента.Ссылка ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда 
			Запрос.УстановитьПараметр("ЗаказПокупателя2", СтруктураШапкиДокумента.Сделка );
		    Запрос.УстановитьПараметр("ЗаказПокупателя",  СтруктураШапкиДокумента.Сделка );  //01.11.2018
			
		иначе	
			Запрос.УстановитьПараметр("ЗаказПокупателя2", СтруктураШапкиДокумента[ИмяРеквизитаЗаказ] );
		    Запрос.УстановитьПараметр("ЗаказПокупателя",  СтруктураШапкиДокумента[ИмяРеквизитаЗаказ] );  //01.11.2018
		КонецЕсли;
		
	КонецЕсли;
			
	Если ЕстьДокументПередачи Тогда
		Запрос.УстановитьПараметр("ДокументПередачи", СтруктураШапкиДокумента.ДокументПередачи);
	КонецЕсли;

	Если Не ЕстьКачество Тогда
		Запрос.УстановитьПараметр("Новый", Справочники.Качество.Новый);
	КонецЕсли;
	
	//23.03.2017 --- оперативно дата меняется на текущую ---
	если флНеоперативно тогда
		Запрос.УстановитьПараметр("ДатаСреза", ДокументОбъект.Дата ); 
	КонецЕсли;

	Запрос.Текст = "
//+++( 14.11.2017 сразу выбирает все поля ТАБ ЧАСТИ заказа !
	|ВЫБРАТЬ
	// Запрос, контролирующий остатки на складах
	|	Док.Номенклатура                                       КАК Номенклатура,
	|	Док.Номенклатура.Представление                         КАК НоменклатураПредставление,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаХраненияОстатковПредставление,"
	+ ?(ЕстьХарактеристика, "
	|	Док.ХарактеристикаНоменклатуры                         КАК ХарактеристикаНоменклатуры,
	|	Док.ХарактеристикаНоменклатуры.Представление           КАК ХарактеристикаНоменклатурыПредставление,"
	,"")
	+ ?(ЕстьСерия, "
	|	Док.СерияНоменклатуры				                   КАК СерияНоменклатуры,
	|	Док.СерияНоменклатуры.Представление                    КАК СерияНоменклатурыПредставление,"
	,"")  
	+ ?(ЕстьДокументРезерва, "
	|	Док.ДокументРезерва                                    КАК ДокументРезерва,"
	,?(ЕстьЗаказПокупателяВШапке, "
	|   &ЗаказПокупателя                                       КАК ДокументРезерва,"
	,""))
	+ ?(Не ЕстьСкладВТабЧасти, "
	|   &Склад                                                 КАК Склад, ", "
	|   Док.Склад                                              КАК Склад,") 
	+ ?(Не ЕстьКачество, "
	|   &Новый                                                 КАК Качество, ", "
	|   Док.Качество                                           КАК Качество,") 
	+ ?(ЕстьКоэффициент, "
	|	Док.Количество * Док.Коэффициент /Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ДокументКоличество", "
	|	Док.Количество                                  КАК ДокументКоличество")
	+"
	|ПОМЕСТИТЬ ВТ_Товары
	
	|из Документ." + ИмяТаблицы + " как Док
	|
	|ГДЕ
	|	Док.Ссылка  =  &ДокументСсылка
	|	И Док.Номенклатура.Услуга=ЛОЖЬ" // остатки по услугам контролировать не надо.
	+ ?(ЕстьСкладВТабЧасти, "
	|	// И Док.Склад.ВидСклада <> &НТТ"   // 20120604 Убрал условие Лапенков 
	, "") + "
	|;
	|////////////////////////////////////////////////////////////////////////////
//++++)
	|ВЫБРАТЬ // Запрос, контролирующий остатки на складах
	|	Док.Номенклатура                                       КАК Номенклатура,
	|	Док.НоменклатураПредставление                         КАК НоменклатураПредставление,
	|	Док.ЕдиницаХраненияОстатковПредставление 			  КАК ЕдиницаХраненияОстатковПредставление,"
	+ ?(ЕстьХарактеристика, "
	|	Док.ХарактеристикаНоменклатуры                        КАК ХарактеристикаНоменклатуры,
	|	Док.ХарактеристикаНоменклатурыПредставление           КАК ХарактеристикаНоменклатурыПредставление,"
	,"")
	+ ?(ЕстьСерия, "
//	|	Док.СерияНоменклатуры								  КАК СерияНоменклатуры,
	|	Док.СерияНоменклатурыПредставление                    КАК СерияНоменклатурыПредставление,"
	,"")  
	+ ?(ЕстьДокументРезерва, "
	|	Док.ДокументРезерва                                    КАК ДокументРезерва,"
	,?(ЕстьЗаказПокупателяВШапке, "
	|   &ЗаказПокупателя                                       КАК ДокументРезерва,"
	,""))
	+ ?(Не ЕстьСкладВТабЧасти, "
	|   &Склад                                                 КАК Склад, ", "
	|   Док.Склад                                              КАК Склад,") 
	+ ?(Не ЕстьКачество, "
	|   &Новый                                                 КАК Качество, ", "
	|   Док.Качество                                           КАК Качество,") 
	
	//+++ 14.11.2017 - уже посчитано
	+"	СУММА(Док.ДокументКоличество) КАК ДокументКоличество,"
	//+ ?(ЕстьКоэффициент, "
	//|	СУММА(Док.ДокументКоличество) КАК ДокументКоличество,", "
	//|	СУММА(Док.Количество)                                  КАК ДокументКоличество,")
	
	+ ?(ЕстьСерия, "
	|	МАКСИМУМ(ОстаткиБезСерии.КоличествоОстаток)            КАК ОстатокБезСерииКоличество,", "") + "
	|	МАКСИМУМ(Остатки.КоличествоОстаток)                    КАК ОстатокКоличество,
	
//+++ 14.12.2016	
//	|	МАКСИМУМ(Резервы.КоличествоОстаток)                    КАК РезервыКоличество,
	|	Максимум(РезервыНаСкладах.КоличествоОстаток) КАК РезервыКоличество,

	|	МАКСИМУМ(ТоварыКПередаче.КоличествоОстаток)            КАК КПередачеКоличество,
	|	МАКСИМУМ(ТоварыКПередачеПоДокументу.КоличествоОстаток) КАК КПередачеПоДокументуКоличество,"
	
//+++ 15.11.2017 - НЕТ ордерной схемы!
	//+? (ИмяДокумента = "ПеремещениеТоваров", "
	//|	МАКСИМУМ(ТоварыКПолучению.КоличествоОстаток)           КАК КПолучению,", "
	//|	0                                                      КАК КПолучению,") + "
	//23.03.2017 |	МАКСИМУМ(РезервыПоДокументу.КоличествоОстаток)         КАК РезервыПоДокументуКоличество
   +"
	|	0 КАК КПолучению,
	|	0 как РезервыПоДокументуКоличество
	|ИЗ 
	
	//+++14.11.2017 +++++++++++++Сразу выбираем то что надо! +++++++++++++++++++++++++++++++++++++++++++++++++++
	//|Документ." + ИмяТаблицы + "
	|	ВТ_Товары КАК Док
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки( "+?(флНеоперативно,"&ДатаСреза","")+" ,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ") " 
	+ ?(Не ЕстьСкладВТабЧасти, "
	|	И Склад = &Склад ", "") + "
	|" + ?(Не ЕстьКачество, "        И Качество = &Новый", "") + "
	|	) КАК Остатки
	|ПО 
	|	Док.Номенклатура                = Остатки.Номенклатура"
	+ ?(ЕстьХарактеристика, "
	| И Док.ХарактеристикаНоменклатуры  = Остатки.ХарактеристикаНоменклатуры"
	,"")
	+ ?(ЕстьКачество, "
	| И Док.Качество  = Остатки.Качество"
	,"")
	+ ?(ЕстьСкладВТабЧасти, "
	| И Док.Склад                       = Остатки.Склад "
	, "")
	+ ?(ЕстьСерия, "
	| И Док.СерияНоменклатуры           = Остатки.СерияНоменклатуры 
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки( "+?(флНеоперативно,"&ДатаСреза","")+" ,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")  
	|" + ?(Не ЕстьСкладВТабЧасти, " И Склад = &Склад ", "") + "
	|	) КАК ОстаткиБезСерии
	|ПО 
	|	Док.Номенклатура                = ОстаткиБезСерии.Номенклатура"
	//15.10.18 Смирнов, брались остатки по всем складам?!
	+ ?(ЕстьСкладВТабЧасти, "
	| И Док.Склад                       = ОстаткиБезСерии.Склад ","")
	//Смирнов
	+ ?(ЕстьХарактеристика, "
	| И Док.ХарактеристикаНоменклатуры  = ОстаткиБезСерии.ХарактеристикаНоменклатуры","")
	,"") + "
	|
	//+++ 23.03.2017 - регистр не используется!
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(,
	//|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	//|		И Склад = &Склад) КАК Резервы
	//|ПО 
	//|	Док.Номенклатура                = Резервы.Номенклатура"
	//+ ?(ЕстьХарактеристика, "
	//| И Док.ХарактеристикаНоменклатуры  = Резервы.ХарактеристикаНоменклатуры"
	//,"")
	//+ ?(ЕстьДокументРезерва, "
	//| И (Док.ДокументРезерва             = Неопределено ИЛИ Док.ДокументРезерва = &ПустойЗаказПокупателя ИЛИ Док.ДокументРезерва = &ПустойВнутреннийЗаказ) "
	//,"")
	//+ ?(ЕстьСпособСписания, "
	//| И Док.СпособСписанияОстаткаТоваров       = &СоСклада"
	//,"") + "
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(,
	//|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	//|		И Склад = &Склад
	//|" + ?(ЕстьЗаказПокупателяВШапке, "		И ДокументРезерва = &ЗаказПокупателя", "") + ") КАК РезервыПоДокументу
	//|ПО 
	//|	Док.Номенклатура                = РезервыПоДокументу.Номенклатура"
	//+ ?(ЕстьХарактеристика, "
	//| И Док.ХарактеристикаНоменклатуры  = РезервыПоДокументу.ХарактеристикаНоменклатуры"
	//,"")
	//+ ?(ЕстьДокументРезерва, "
	//| И Док.ДокументРезерва             = РезервыПоДокументу.ДокументРезерва","") 
	//+ ?(ЕстьСпособСписания, "
	//| И Док.СпособСписанияОстаткаТоваров       = &ИзРезерва"
	//,"") + "
	
//====================================РЕЗЕРВЫ ПО СКЛАДАМ=================================	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|( ВЫБРАТЬ
	//+ и - закрываются в 0!
	|	рез.Номенклатура, рез.Склад, Сумма(рез.КоличествоОстаток) как КоличествоОстаток
	| ИЗ	
	|	РегистрНакопления.РезервНаСкладах.Остатки( 
	|" + ?(флНеоперативно,"&ДатаСреза","")+"
	|,		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	//15.12.2016 - НАДО именно с отбором по 1 складу из шапки! или по складам ТЧ!
	|" + ?(не ЕстьСкладВТабЧасти, " И Склад = &Склад", "")+"
	//14.12.2016 задача №16950 все резервы БЕЗ этого заказа!
	|" + ?(ЕстьЗаказПокупателяВШапке, "		И ЗаказПокупателя <> &ЗаказПокупателя2", "") +"
	|) как рез
//+++ 01.11.2018 --- Задача № 58257 - ЕСТЬ минусы по резервам?! нужна "+" сумма  ----------
	//|ГДЕ рез.КоличествоОстаток>0
	|СГРУППИРОВАТЬ ПО 
	|	рез.Номенклатура, рез.Склад
	|Имеющие 
	|	Сумма(рез.КоличествоОстаток)>0
	|
	
	|) КАК РезервыНаСкладах
	|ПО 
	|	Док.Номенклатура                = РезервыНаСкладах.Номенклатура
	//15.12.2016 - если есть склад в ТЧ - то тут связка обязательна!
	|"+ ?(ЕстьСкладВТабЧасти, "И Док.Склад = РезервыНаСкладах.Склад ","")+"
//========================================================================================
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	|" + ?(не ЕстьСкладВТабЧасти, "	И Склад = &Склад","")+"
	|	) КАК ТоварыКПередаче
	|ПО 
	|	Док.Номенклатура                = ТоварыКПередаче.Номенклатура
	|"+ ?(ЕстьХарактеристика, "И Док.ХарактеристикаНоменклатуры  = ТоварыКПередаче.ХарактеристикаНоменклатуры","") + "
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	|		И Склад = &Склад
	|" + ?(ЕстьЗаказПокупателяВШапке, "		И ДокументПередачи = &ДокументСсылка", "") + "
	|) КАК ТоварыКПередачеПоДокументу
	|ПО 
	|	Док.Номенклатура                = ТоварыКПередачеПоДокументу.Номенклатура
	|"+ ?(ЕстьХарактеристика,  " И Док.ХарактеристикаНоменклатуры  = ТоварыКПередачеПоДокументу.ХарактеристикаНоменклатуры","")+"
	|"+ ?(ЕстьДокументПередачи," И &ДокументПередачи = ТоварыКПередачеПоДокументу.ДокументПередачи",
			?(ЕстьДокументРезерва,"
			| И Док.ДокументРезерва            = ТоварыКПередачеПоДокументу.ДокументПередачи", ""))+ "
	
	// Если мы перемещаем товар, то товар поступивший по ордеру не может быть перемещен без указания этого
	// ордера в качестве документа резрерва, поэтому остатки регистра "Товары к получению на склады" надо
	// вычесть из свободного остатка
	
//+++ 15.11.2017 - НЕТ ордерной схемы! ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	//+? (ИмяДокумента = "ПеремещениеТоваров", "
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.ТоварыКПолучениюНаСклады.Остатки(,
	//|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	//|		И Склад = &Склад
	//|		// Документ получения может быть только ордером, причем ордра без права продажи не учитываем,
	//|       // поскольку они уже учтены в регистре резервов
	//|		И ДокументПолучения ССЫЛКА Документ.ПриходныйОрдерНаТовары
	//|       И НЕ ДокументПолучения.БезПраваПродажи) КАК ТоварыКПолучению
	//|ПО 
	//|	Док.Номенклатура                = ТоварыКПолучению.Номенклатура"
	//+ ?(ЕстьХарактеристика, "
	//| И Док.ХарактеристикаНоменклатуры  = ТоварыКПолучению.ХарактеристикаНоменклатуры"
	//,"") 	+ "
	//| И (Док.ДокументРезерва            = &ПустойОрдер ИЛИ Не Док.ДокументРезерва ССЫЛКА Документ.ПриходныйОрдерНаТовары)","") 
	
//+++ 14.11.2017 - вынесена в ВТ
	//|ГДЕ
	//|	Док.Ссылка  =  &ДокументСсылка
	//|	И Не Док.Номенклатура.Услуга" // остатки по услугам контролировать не надо.
	//+ ?(ЕстьСкладВТабЧасти, "
	//|	// И Док.Склад.ВидСклада <> &НТТ"   // 20120604 Убрал условие Лапенков 
	//, "") + "
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Док.Номенклатура,
	|	Док.НоменклатураПредставление,
	|	Док.ЕдиницаХраненияОстатковПредставление"
	+ ?(ЕстьХарактеристика, ",
	|	 Док.ХарактеристикаНоменклатуры,
	|	 Док.ХарактеристикаНоменклатурыПредставление"
	,"")
	+ ?(ЕстьСерия, ",
	|	 Док.СерияНоменклатуры,
	|	 Док.СерияНоменклатурыПредставление"
	,"")
	+ ?(ЕстьСкладВТабЧасти, ",
	|    Док.Склад", "")
	+ ?(ЕстьКачество , ",
	|	 Док.Качество", "") 
	+ ?(ЕстьДокументРезерва , ",
	|	 Док.ДокументРезерва", "") 
	+ ?(ЕстьСерия, "
	|ИТОГИ СУММА (ДокументКоличество), МАКСИМУМ(ОстатокБезСерииКоличество), МАКСИМУМ(РезервыКоличество),
	|         МАКСИМУМ(КПередачеКоличество), МАКСИМУМ(РезервыПоДокументуКоличество)
	|ПО Номенклатура"
	+ ?(ЕстьХарактеристика, ",
	|	 ХарактеристикаНоменклатуры ", "") 
	+ ?(ЕстьСкладВТабЧасти, ",
	|    Склад", "")
	+ ?(ЕстьДокументРезерва , ",
	|	 ДокументРезерва", ""), "") + "
	|
	|//ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ТоварыНаСкладах.Остатки, РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки, РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки // Блокирующие чтение таблицы остатков регистра для разрешения коллизий многопользовательской работы
	
	|;УНИЧТОЖИТЬ ВТ_Товары";

	 РезультатЗапроса = Запрос.Выполнить();
	 Выборка = РезультатЗапроса.Выбрать();
	 
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			ДокументКоличествоБезСерии = Выборка.ДокументКоличество;
			Продолжить;
		КонецЕсли;

		КоличествоНаСкладе           = ?(Выборка.ОстатокКоличество = NULL, 0, Выборка.ОстатокКоличество);
		
		КоличествоВРезерве             = 0; //+++ 02.11.2018  ЛИШНИЙ! ?(Выборка.РезервыКоличество = NULL, 0, Выборка.РезервыКоличество);//+++ 14.12.2016 тут 
		РезервыПоДокументуКоличество   = ?(Выборка.РезервыПоДокументуКоличество = NULL, 0, Выборка.РезервыПоДокументуКоличество);
		КПередачеКоличество            = ?(Выборка.КПередачеКоличество = NULL, 0, Выборка.КПередачеКоличество);
		КПолучениюКоличество           = ?(Выборка.КПолучению = NULL, 0, Выборка.КПолучению);
		КПередачеПоДокументуКоличество = ?(Выборка.КПередачеПоДокументуКоличество = NULL, 0, Выборка.КПередачеПоДокументуКоличество);

		Если ЕстьСерия Тогда
			КоличествоНаСкладеБезСерии = ?(Выборка.ОстатокБезСерииКоличество = NULL, 0, Выборка.ОстатокБезСерииКоличество);
			
			Если КоличествоНаСкладе < Выборка.ДокументКоличество Тогда
				СтрокаСообщения = "Остатка " + 
				ПредставлениеНоменклатуры(Выборка.НоменклатураПредставление, 
										  ?(ЕстьХарактеристика, Выборка.ХарактеристикаНоменклатурыПредставление, ""),
										  ?(ЕстьСерия, Выборка.СерияНоменклатурыПредставление,"")) +									  
				" с качеством """ + СокрЛП(Выборка.Качество) + """ на складе """ + СокрЛП(Выборка.Склад) + """ недостаточно.";
				ОшибкаНетОстатка(СтрокаСообщения, КоличествоНаСкладе, Выборка.ДокументКоличество,
									Выборка.ЕдиницаХраненияОстатковПредставление, Отказ, Заголовок);
				Продолжить;
			КонецЕсли;
			
			колМинус = (КоличествоВРезерве - РезервыПоДокументуКоличество + КПередачеКоличество + КПолучениюКоличество - КПередачеПоДокументуКоличество); //26.10.2018
			Если КоличествоНаСкладеБезСерии -  колМинус < ДокументКоличествоБезСерии Тогда
				СтрокаСообщения = ?(КоличествоВРезерве > 0, "Свободного остатка ", "Остатка ") + 
				ПредставлениеНоменклатуры(Выборка.НоменклатураПредставление, 
				                          ?(ЕстьХарактеристика, Выборка.ХарактеристикаНоменклатурыПредставление, "")) +									  
				" на складе """ + СокрЛП(Выборка.Склад) + """ недостаточно.";
              //ОшибкаНетОстатка(СтрокаСообщения, КоличествоНаСкладеБезСерии - (КоличествоВРезерве - РезервыПоДокументуКоличество + КПередачеКоличество + КПолучениюКоличество), ДокументКоличествоБезСерии,
				ОшибкаНетОстатка(СтрокаСообщения, КоличествоНаСкладеБезСерии - (колМинус + КПередачеПоДокументуКоличество), ДокументКоличествоБезСерии,
									Выборка.ЕдиницаХраненияОстатковПредставление, Отказ, Заголовок);
			//	Сообщить("Уже установлен резерв на отгрузку: " + (КоличествоВРезерве - РезервыПоДокументуКоличество + КПередачеКоличество - КПередачеПоДокументуКоличество) + " " + Выборка.ЕдиницаХраненияОстатковПредставление);
				Сообщить("Уже установлен резерв на отгрузку: " + (колМинус - КПолучениюКоличество) + " " + Выборка.ЕдиницаХраненияОстатковПредставление);
			КонецЕсли;
			
		Иначе //---------------------------------------------------------------------------------------------------------------------------------------------------------------------
			
			колМинус = (КоличествоВРезерве - РезервыПоДокументуКоличество + КПередачеКоличество + КПолучениюКоличество - КПередачеПоДокументуКоличество); //26.10.2018
			Если КоличествоНаСкладе - колМинус < Выборка.ДокументКоличество Тогда
				СтрокаСообщения = ?(КоличествоВРезерве > 0, "Свободного остатка ", "Остатка ") + 
				ПредставлениеНоменклатуры(Выборка.НоменклатураПредставление, 
				                          ?(ЕстьХарактеристика, Выборка.ХарактеристикаНоменклатурыПредставление, ""),
				                          ?(ЕстьСерия, Выборка.СерияНоменклатурыПредставление,"")) +
				" на складе """ + СокрЛП(Выборка.Склад) +""" недостаточно.";

//				ОшибкаНетОстатка(СтрокаСообщения, КоличествоНаСкладе - (КоличествоВРезерве - РезервыПоДокументуКоличество + КПередачеКоличество + КПолучениюКоличество), Выборка.ДокументКоличество,
				ОшибкаНетОстатка(СтрокаСообщения, КоличествоНаСкладе - (колМинус + КПередачеПоДокументуКоличество), Выборка.ДокументКоличество,
				Выборка.ЕдиницаХраненияОстатковПредставление, Отказ, Заголовок);
//				Сообщить("Уже установлен резерв на отгрузку: " + (КоличествоВРезерве - РезервыПоДокументуКоличество + КПередачеКоличество - КПередачеПоДокументуКоличество) + " " + Выборка.ЕдиницаХраненияОстатковПредставление);
				Сообщить("Уже установлен резерв на отгрузку: " + (колМинус - КПолучениюКоличество) + " " + Выборка.ЕдиницаХраненияОстатковПредставление);
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // КонтрольОстатков()

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщегние.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - строка, имя табличной части, которая проводится по регистру, 
//  СтруктураШапкиДокумента - структура, содержащая значения "через точку" ссылочных реквизитов по шапке документа,
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатковРазукомплектация(ДокументОбъект, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт

	Если РазрешеноПревышениеОстаткаТоваровНаСкладе() Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;
	ИмяТаблицы          = ИмяДокумента;
	ЕстьСерия           = ЕстьРеквизитДокумента("СерияНоменклатуры", МетаданныеДокумента);
	ЕстьХарактеристика  = ЕстьРеквизитДокумента("ХарактеристикаНоменклатуры", МетаданныеДокумента);
	ЕстьСпособСписания  = ЕстьРеквизитДокумента("СпособСписания", МетаданныеДокумента);
	ЕстьДокументРезерва = ЕстьРеквизитДокумента("ДокументРезерва", МетаданныеДокумента);
	ЕстьСкладВТабЧасти  = ЕстьРеквизитДокумента("Склад", МетаданныеДокумента);

	ЕстьЗаказПокупателяВШапке = Ложь;
	Если ЕстьРеквизитДокумента("Сделка", МетаданныеДокумента) Тогда
		ИмяРеквизитаЗаказ = "Сделка";
		ЕстьЗаказПокупателяВШапке = НЕ ЗначениеНеЗаполнено(СтруктураШапкиДокумента.Сделка) 
									И ТипЗнч(СтруктураШапкиДокумента.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя");
	ИначеЕсли ЕстьРеквизитДокумента("Заказ", МетаданныеДокумента) Тогда
		ИмяРеквизитаЗаказ = "Заказ";
		ЕстьЗаказПокупателяВШапке = НЕ ЗначениеНеЗаполнено(СтруктураШапкиДокумента.Заказ) 
									И ТипЗнч(СтруктураШапкиДокумента.Заказ) = Тип("ДокументСсылка.ЗаказПокупателя");
	КонецЕсли;

	// Текст вложенного запроса, ограничивающего номенклатуру при получении остатков
	ТекстЗапросаСписокНоменклатуры = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура 
	|ИЗ
	|	Документ." + ИмяТаблицы +"
	|ГДЕ Ссылка = &ДокументСсылка";


	Запрос = Новый Запрос;

	// Для перемещения надо проверять по складу "Склад-отправитель", а для остальных документов - просто "Склад"
	ТекСклад = СтруктураШапкиДокумента.Склад;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("Склад", ТекСклад); 
	Запрос.УстановитьПараметр("СоСклада", Перечисления.СпособыСписанияОстаткаТоваров.СоСклада); 
	Запрос.УстановитьПараметр("ИзРезерва", Перечисления.СпособыСписанияОстаткаТоваров.ИзРезерва); 
	Запрос.УстановитьПараметр("ПустойЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка()); 
	Запрос.УстановитьПараметр("ПустойВнутреннийЗаказ", Документы.ВнутреннийЗаказ.ПустаяСсылка()); 
	Если ЕстьЗаказПокупателяВШапке Тогда
		Запрос.УстановитьПараметр("ЗаказПокупателя", СтруктураШапкиДокумента[ИмяРеквизитаЗаказ]);
	КонецЕсли;
  
	Запрос.Текст = "
	|ВЫБРАТЬ // Запрос, контролирующий остатки на складах
	|	Док.Номенклатура.Представление                         КАК НоменклатураПредставление,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаХраненияОстатковПредставление,"
	+ ?(ЕстьХарактеристика, "
	|	Док.ХарактеристикаНоменклатуры.Представление           КАК ХарактеристикаНоменклатурыПредставление,"
	,"")
	+ ?(ЕстьСерия, "
	|	Док.СерияНоменклатуры.Представление                    КАК СерияНоменклатурыПредставление,"
	,"")  
	+ ?(ЕстьДокументРезерва, "
	|	Док.ДокументРезерва                                    КАК ДокументРезерва,"
	,?(ЕстьЗаказПокупателяВШапке, "
	|   &ЗаказПокупателя                                       КАК ДокументРезерва,"
	,""))
	+ ?(Не ЕстьСкладВТабЧасти, "
	|   &Склад                                                 КАК Склад, ", "
	|   Док.Склад,") + "
	|	СУММА(Док.Количество)                                   КАК ДокументКоличество,
	|	МАКСИМУМ(Остатки.КоличествоОстаток)                    КАК ОстатокКоличество,
	
	//23.03.2017 - не используется!
	//|	МАКСИМУМ(Резервы.КоличествоОстаток)                    КАК РезервыКоличество,
//	|	МАКСИМУМ(ТоварыКПередаче.КоличествоОстаток)            КАК КПередачеКоличество,
//	|	МАКСИМУМ(РезервыПоДокументу.КоличествоОстаток)         КАК РезервыПоДокументуКоличество
	|	0 КАК РезервыКоличество,
	|	0 КАК КПередачеКоличество,
    |	0 как РезервыПоДокументуКоличество
	
	|ИЗ 
	|	Документ." + ИмяТаблицы + " КАК Док
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки( ,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ") " 
	+ ?(Не ЕстьСкладВТабЧасти, "
	|	И Склад = &Склад ", "") + "
	|	) КАК Остатки
	|ПО 
	|	Док.Номенклатура                = Остатки.Номенклатура"
	+ ?(ЕстьХарактеристика, "
	| И Док.ХарактеристикаНоменклатуры  = Остатки.ХарактеристикаНоменклатуры"
	,"")
	+ ?(ЕстьСерия, "
	| И Док.СерияНоменклатуры           = Остатки.СерияНоменклатуры"
	,"")
	+ ?(ЕстьСкладВТабЧасти, "
	| И Док.Склад                       = Остатки.Склад "
	, "") + "
	|
//-------------------------23.03.2017 - не используется!--------------------------------------
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(,
	//|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	//|		И Склад = &Склад) КАК Резервы
	//|ПО 
	//|	Док.Номенклатура                = Резервы.Номенклатура"
	//+ ?(ЕстьХарактеристика, "
	//| И Док.ХарактеристикаНоменклатуры  = Резервы.ХарактеристикаНоменклатуры"
	//,"")
	//+ ?(ЕстьДокументРезерва, "
	//| И (Док.ДокументРезерва             = Неопределено ИЛИ Док.ДокументРезерва = &ПустойЗаказПокупателя ИЛИ Док.ДокументРезерва = &ПустойВнутреннийЗаказ) "
	//,"")
	//+ ?(ЕстьСпособСписания, "
	//| И Док.СпособСписания              = &СоСклада"
	//,"") + "
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(,
	//|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	//|		И Склад = &Склад
	//|" + ?(ЕстьЗаказПокупателяВШапке, "		И ДокументРезерва = &ЗаказПокупателя", "") + ") КАК РезервыПоДокументу
	//|ПО 
	//|	Док.Номенклатура                = РезервыПоДокументу.Номенклатура"
	//+ ?(ЕстьХарактеристика, "
	//| И Док.ХарактеристикаНоменклатуры  = РезервыПоДокументу.ХарактеристикаНоменклатуры"
	//,"")
	//+ ?(ЕстьДокументРезерва, "
	//| И Док.ДокументРезерва             = РезервыПоДокументу.ДокументРезерва"
	//,"")
	//+ ?(ЕстьСпособСписания, "
	//| И Док.СпособСписания              = &ИзРезерва"
	//,"") + "
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(,
	//|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	//|		И Склад = &Склад
	//|" + ?(ЕстьЗаказПокупателяВШапке, "		И ДокументПередачи <> &ДокументСсылка", "") + ") КАК ТоварыКПередаче
	//|ПО 
	//|	Док.Номенклатура                = ТоварыКПередаче.Номенклатура"
	//+ ?(ЕстьХарактеристика, "
	//| И Док.ХарактеристикаНоменклатуры  = ТоварыКПередаче.ХарактеристикаНоменклатуры"
	//,"") + "
//---------------------------------------------------------------------------------------------
	|
	|ГДЕ
	|	Док.Ссылка  =  &ДокументСсылка
	|	И Не Док.Номенклатура.Услуга // остатки по услугам контролировать не надо.	
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Док.Номенклатура"
	+ ?(ЕстьХарактеристика, ",
	|	 Док.ХарактеристикаНоменклатуры "
	,"")
	+ ?(ЕстьСерия, ",
	|	 Док.СерияНоменклатуры"
	,"")
	+ ?(ЕстьСкладВТабЧасти, ",
	|    Док.Склад", "")
	+ ?(ЕстьДокументРезерва , ",
	|	 Док.ДокументРезерва", "") + "
	|
	//|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ТоварыНаСкладах.Остатки, РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки // Блокирующие чтение таблицы остатков регистра для разрешения коллизий многопользовательской работы
	|";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		КоличествоНаСкладе           = ?(Выборка.ОстатокКоличество = NULL, 0, Выборка.ОстатокКоличество);
		КоличествоВРезерве           = ?(Выборка.РезервыКоличество = NULL, 0, Выборка.РезервыКоличество); 
		РезервыПоДокументуКоличество = ?(Выборка.РезервыПоДокументуКоличество = NULL, 0, Выборка.РезервыПоДокументуКоличество);
		КПередачеКоличество          = ?(Выборка.КПередачеКоличество = NULL, 0, Выборка.КПередачеКоличество);

		Если КоличествоНаСкладе - (КоличествоВРезерве - РезервыПоДокументуКоличество + КПередачеКоличество) < Выборка.ДокументКоличество Тогда

			СтрокаСообщения = ?(КоличествоВРезерве > 0, "Свободного остатка ", "Остатка ") + 
			ПредставлениеНоменклатуры(Выборка.НоменклатураПредставление, 
			                          ?(ЕстьХарактеристика, Выборка.ХарактеристикаНоменклатурыПредставление, ""),
			                          ?(ЕстьСерия, Выборка.СерияНоменклатурыПредставление,"")) +									  
			" на складе """ + СокрЛП(Выборка.Склад) +
			""" недостаточно.";

			ОшибкаНетОстатка(СтрокаСообщения, КоличествоНаСкладе - (КоличествоВРезерве - РезервыПоДокументуКоличество + КПередачеКоличество), Выборка.ДокументКоличество,
			Выборка.ЕдиницаХраненияОстатковПредставление, Отказ, Заголовок);
			Сообщить("Зарезервировано " + (КоличествоВРезерве - РезервыПоДокументуКоличество + КПередачеКоличество) + " " + Выборка.ЕдиницаХраненияОстатковПредставление);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // КонтрольОстатков()

Процедура ПередЗаписью(Отказ, Замещение)
		
	ПроверкаПериодаЗаписей(ЭтотОбъект, Отказ);
	
КонецПроцедуры
